---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.NoBarSizeError
source: html/9014e174-dd82-a368-48cd-5e398c984777.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.NoBarSizeError Property

This is used to post error. At least Bar Size 1 or Bar Size 2 should have another value than "None".

## Syntax (C#)
```csharp
public static FailureDefinitionId NoBarSizeError { get; }
```